#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Terraform
data.local_file.logo: Reading...
data.local_file.oas_spec: Reading...
data.local_file.oas_spec: Read complete after 0s [id=f2ee0296b1a80178fc3ec9d7cf37670aafd22f55]
data.local_file.logo: Read complete after 0s [id=c0b4f0d4f8e21e1c63c55f52a9b913f410526ef3]
aws_s3_bucket.public_bucket: Preparing import... [id=tagmine-api]
aws_iam_user.tagmine-api-gha: Preparing import... [id=tagmine-api-gha]
aws_iam_user.tagmine-api-gha: Refreshing state... [id=tagmine-api-gha]
aws_s3_bucket.public_bucket: Refreshing state... [id=tagmine-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.public_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "public_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::tagmine-api/*",
            ]
          + sid       = "Public Access"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "yes",
                ]
              + variable = "s3:ExistingObjectTag/public"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::tagmine-api",
              + "arn:aws:s3:::tagmine-api/*",
            ]
          + sid       = "GHA User Access"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::651940083584:user/tagmine-api-gha",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_iam_user.tagmine-api-gha will be updated in-place
  # (imported from "tagmine-api-gha")
  ~ resource "aws_iam_user" "tagmine-api-gha" {
        arn           = "arn:aws:iam::651940083584:user/tagmine-api-gha"
      + force_destroy = false
        id            = "tagmine-api-gha"
        name          = "tagmine-api-gha"
        path          = "/"
      ~ tags          = {
          - "AKIAZPSVIG6AH5GLFWML" = "tagmine-api-gha" -> null
          - "use"                  = "tagmine" -> null
        }
      ~ tags_all      = {
          - "AKIAZPSVIG6AH5GLFWML" = "tagmine-api-gha"
          - "use"                  = "tagmine"
        } -> (known after apply)
        unique_id     = "AIDAZPSVIG6AEHCA6UDNQ"
    }

  # aws_s3_bucket.public_bucket will be imported
    resource "aws_s3_bucket" "public_bucket" {
        arn                         = "arn:aws:s3:::tagmine-api"
        bucket                      = "tagmine-api"
        bucket_domain_name          = "tagmine-api.s3.amazonaws.com"
        bucket_regional_domain_name = "tagmine-api.s3.ca-central-1.amazonaws.com"
        hosted_zone_id              = "Z1QDHH18159H29"
        id                          = "tagmine-api"
        object_lock_enabled         = false
        policy                      = jsonencode(
            {
                Statement = [
                    {
                        Action    = "s3:GetObject"
                        Condition = {
                            StringEquals = {
                                "s3:ExistingObjectTag/public" = "yes"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "arn:aws:s3:::tagmine-api/*"
                        Sid       = "Public Access"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        region                      = "ca-central-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "repo" = "tagmine-api"
            "use"  = "oss"
        }
        tags_all                    = {
            "repo" = "tagmine-api"
            "use"  = "oss"
        }

        grant {
            id          = "0fbabc4011774cdafafba718e01e6eb0157e228b6761d68045899bc51509a8eb"
            permissions = [
                "FULL_CONTROL",
            ]
            type        = "CanonicalUser"
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = true

                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = true
            mfa_delete = false
        }
    }

  # aws_s3_bucket_policy.public_access will be created
  + resource "aws_s3_bucket_policy" "public_access" {
      + bucket = "tagmine-api"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_object.logo will be created
  + resource "aws_s3_object" "logo" {
      + bucket                 = "tagmine-api"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "bfef4676de48d047ef3c165f6fdd3a96"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "logo.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../logo.jpg"
      + storage_class          = (known after apply)
      + tags                   = {
          + "public" = "yes"
          + "use"    = "icon"
        }
      + tags_all               = {
          + "public" = "yes"
          + "use"    = "icon"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.oas_spec will be created
  + resource "aws_s3_object" "oas_spec" {
      + bucket                 = "tagmine-api"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "bf411747093ef66d4e449d2e3f6b288d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "openapi.yaml"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../openapi.yaml"
      + storage_class          = (known after apply)
      + tags                   = {
          + "public" = "yes"
          + "use"    = "api definition"
        }
      + tags_all               = {
          + "public" = "yes"
          + "use"    = "api definition"
        }
      + version_id             = (known after apply)
    }

Plan: 2 to import, 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Nexushunter, Action: `push`*